HB9GZE/Pub_DIY_HAM_Radio_Transceiver/STM32H735DK/TGFX_SO/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "app_touchgfx.h"
#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32h735g_discovery_ospi.h"
#include "usbd_cdc_if.h"
#include "arm_math.h"
#include "si5351.h"

#include "FreeRTOS.h"
#include "queue.h"
#include "task.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define ARM_MATH_CM7
#define INPUT_SAMPLES 2048

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c4;

LTDC_HandleTypeDef hltdc;

OSPI_HandleTypeDef hospi1;
OSPI_HandleTypeDef hospi2;

UART_HandleTypeDef huart7;
UART_HandleTypeDef huart1;

/* Definitions for TouchGFXTask */
osThreadId_t TouchGFXTaskHandle;
const osThreadAttr_t TouchGFXTask_attributes =
{ .name = "TouchGFXTask", .priority = (osPriority_t) osPriorityNormal, .stack_size = 1024 * 4 };
/* Definitions for myTask02 */
osThreadId_t myTask02Handle;
const osThreadAttr_t myTask02_attributes =
{ .name = "myTask02", .priority = (osPriority_t) osPriorityLow, .stack_size = 128 * 4 };
/* Definitions for myTask03 */
osThreadId_t myTask03Handle;
const osThreadAttr_t myTask03_attributes =
{ .name = "myTask03", .priority = (osPriority_t) osPriorityNormal, .stack_size = 1024 * 4 };
/* USER CODE BEGIN PV */

uint8_t nowTransmittingSW = 0, nowTransmittingHW = 0;
uint8_t txOutput = 0;
uint8_t fromView1 = 0, fromView2 = 0;
uint8_t bandHasChanged = 0;
uint8_t transmitFlag;

float vco_80m = 3573.0, vco_40m = 7074.0, vco_20m = 14074.0;
float vco_80m_s = 3573, vco_40m_s = 7074, vco_20m_s = 14074; //_s for slider value (integer; rounded from float)
float vco_80m_dec = 0, vco_40m_dec = 0, vco_20m_dec = 0; //_dec for handling the fine tuning (with 1/10th decimal fraction)
uint32_t vco_80m_5351, vco_40m_5351, vco_20m_5351;
uint32_t bfo_80m_5351, bfo_40m_5351, bfo_20m_5351;

float bfo_80m = 9000.0, bfo_40m = 9000.0, bfo_20m = 9000.0;
float bfo_80m_s = 9000, bfo_40m_s = 9000, bfo_20m_s = 9000;
float bfo_80m_dec = 0, bfo_40m_dec = 0, bfo_20m_dec = 0;

uint8_t bandSelected = 80; //80 = 80m, 40 = 40m, 20 = 20m

uint32_t theQueueVFOValue = 0;
uint32_t theQueueBFOValue = 0;
uint8_t theQueueBandValue = 0;

struct FreqandBand
{
	uint32_t frequencyValue;
	uint8_t bandValue;
};

struct FreqandBand queueUpdateValue;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_CRC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_LTDC_Init(void);
static void MX_OCTOSPI1_Init(void);
static void MX_OCTOSPI2_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C4_Init(void);
static void MX_UART7_Init(void);
void TouchGFX_Task(void *argument);
void StartTask02(void *argument);
void StartTask03(void *argument);

/* USER CODE BEGIN PFP */
void dummy(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void dummy()
{
	int a = 100;
	(void) a;
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MPU Configuration--------------------------------------------------------*/
	MPU_Config();

	/* Enable I-Cache---------------------------------------------------------*/
	SCB_EnableICache();

	/* Enable D-Cache---------------------------------------------------------*/
	SCB_EnableDCache();

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_CRC_Init();
	MX_DMA2D_Init();
	MX_LTDC_Init();
	MX_OCTOSPI1_Init();
	MX_OCTOSPI2_Init();
	MX_USART1_UART_Init();
	//MX_I2C4_Init();
	MX_UART7_Init();
	MX_TouchGFX_Init();
	/* USER CODE BEGIN 2 */
	vco_80m_5351 = 12650000;
	vco_40m_5351 = 16100000;
	vco_20m_5351 = 23175000;
	bfo_80m_5351 = 9000000;
	bfo_40m_5351 = 9000000;
	bfo_20m_5351 = 9000000;
//	si5351_Init();
//	si5351_setupPLL(SI5351_PLL_A, 36, 0, 1);
//	si5351_setupPLL(SI5351_PLL_B, 36, 0, 1);
//	si5351_set_freq(0, SI5351_PLL_A, vco_80m_5351); //VFO
//	si5351_set_freq(1, SI5351_PLL_A, bfo_80m_5351); //spectrum mixer
//	si5351_set_freq(2, SI5351_PLL_A, vco_80m_5351); //BFO
//	si5351_enableOutputs(0xff);

	/* make sure transmit is off */
	nowTransmittingHW = nowTransmittingSW = 0;
	HAL_GPIO_WritePin(GPIOE, GPIO_PIN_10, GPIO_PIN_RESET);

	/* USER CODE END 2 */

